## Staging: dynamodb
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |            NAME            |
|----------|----------------------------|
| recreate | `aws_dynamodb_table.vault` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.vault must be replaced
-/+ resource "aws_dynamodb_table" "vault" {
      ~ arn              = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault" -> (known after apply)
      ~ id               = "Vault" -> (known after apply)
        name             = "Vault"
      ~ range_key        = "NAME_OR_CONF" -> "NAME_OR_CONF_OR_TEST" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ write_capacity   = 0 -> (known after apply)
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "NAME_OR_CONF" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "NAME_OR_CONF_OR_TEST"
          + type = "S"
        }

      - global_secondary_index {
          - hash_key           = "FormID" -> null
          - name               = "Status" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - range_key          = "Status" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      - global_secondary_index {
          - hash_key           = "Status" -> null
          - name               = "Archive" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - range_key          = "RemovalDate" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      - global_secondary_index {
          - hash_key           = "Status" -> null
          - name               = "Nagware" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - range_key          = "CreatedAt" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "FormID"
          + name               = "Status"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "Status"
        }
      + global_secondary_index {
          + hash_key           = "Status"
          + name               = "Archive"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "RemovalDate"
        }
      + global_secondary_index {
          + hash_key           = "Status"
          + name               = "Nagware"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "CreatedAt"
        }

      - ttl {
          - enabled = false -> null
        }

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dynamodb_vault_arn             = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
